{
  "app-title": "Home | Takashi Yamamoto • Senior Full-Stack & AI Engineer Portfolio",
  "loading": "Loading...",
  "greetings": "Hi there, I'm ",
  "name": "Takashi",
  "name-end": ".",
  "sub-heading": "Senior Full-Stack & AI Engineer",
  "more-info": "Senior Software Engineer with 10+ years of experience in full-stack development and AI/ML engineering. Based in Tokyo, I specialize in building high-quality web applications, AI-powered solutions, and scalable backend systems for startups and enterprise clients.",
  "resume-btn": "resume",
  "about-heading": "about me",
  "about-text-top": "Highly motivated Senior Software Engineer with 8 years of experience in front-end development and 5 years in back-end development. I have a proven track record in building high-quality web and mobile applications from scratch, particularly within startups and freelance environments. My expertise lies in delivering clean, useful, and 100% customer-focused products.",
  "about-text-bottom": "Recently, I've expanded into AI/ML engineering, building backend ML/analytics pipelines for time-series anomaly detection at Seeq Corporation, and currently leading AI solutions including multilingual NLP/RAG pipelines at SBWorks. I'm equally comfortable working in Japanese and English environments, collaborating with cross-cultural teams across the globe.",
  "technology-heading": "technology",
  "projects-heading": "projects",
  "featured-tag": "featured project",
  "projects": [
    {
      "id": 1,
      "description": "B2B Sales Intelligence SaaS platform with AI-powered lead generation, intelligent scoring, and interactive analytics dashboards. Features GPT-4 powered sales assistant, automated outreach generation, and real-time pipeline visualization."
    },
    {
      "id": 2,
      "description": "Full-stack ChatGPT clone built with the MERN stack (MongoDB, Express.js, React, Node.js) using OpenAI GPT-3.5 Turbo API. Features authentication, Google OAuth, real-time AI chat, auto-save to MongoDB, chat history, dark/light mode, and PWA support."
    },
    {
      "id": 3,
      "description": "AI-powered clinical decision support system using RAG architecture to query medical literature, drug interactions, and treatment guidelines. Supports Japanese and English medical terminology with citation-backed answers."
    },
    {
      "id": 4,
      "description": "AI Agent Builder empowers users to create sophisticated AI-powered automation workflows through an intuitive visual interface. Built with modern full-stack architecture, it demonstrates enterprise-level patterns for real-time collaboration, serverless computing, and intelligent agent orchestration."
    },
    {
      "id": 5,
      "description": "Open-source AI chat application built with TypeScript and Next.js, it uses Supabase for backend storage. Version 2.0 supports various AI models with Docker and Vercel deployment options."
    },
    {
      "id": 6,
      "description": "Conversational AI chatbot built with Flask and ChatterBot. Uses natural language processing with NLTK to understand and respond to user messages. Features real-time chat interface and trained on English conversation corpus."
    },
    {
      "id": 7,
      "description": "Designed scalable document processing system handling >500K documents/month. Features multilingual OCR, NLP extraction, and intelligent classification."
    },
    {
      "id": 8,
      "description": "End-to-end RAG system with vector databases, semantic search, and LLM integration. Supports enterprise knowledge management with high retrieval accuracy."
    },
    {
      "id": 9,
      "description": "Voice AI system with real-time speech recognition, natural language understanding, and text-to-speech. Supports Japanese and English with low latency."
    },
    {
      "id": 10,
      "description": "Automated business workflows using n8n, integrating AI services, databases, and external APIs. Reduced manual processes by 80% for enterprise clients."
    },
    {
      "id": 11,
      "description": "Cloud-native MLOps pipeline with Docker, Kubernetes, and CI/CD automation. Features model versioning, A/B testing, and automated retraining triggers."
    },
    {
      "id": 12,
      "description": "Real-time event streaming platform using Kafka and Spark. Processes high-volume data for industrial analytics with sub-second latency."
    },
    {
      "id": 13,
      "description": "E-commerce predictive analytics system for demand forecasting and customer behavior analysis. Improved inventory efficiency by 35%."
    }
  ],
  "show-more-btn": "show more",
  "show-less-btn": "show less",
  "learn-more": "more info",
  "navigation": [
    {
      "menuTitle": "home",
      "href": "/#home"
    },
    {
      "menuTitle": "about",
      "href": "/#about"
    },
    {
      "menuTitle": "technology",
      "href": "/#technology"
    },
    {
      "menuTitle": "projects",
      "href": "/#projects"
    }
  ],
  "footer-contact": "e-mail",
  "footer-message": "Website by Takashi Yamamoto"
}
